{"data":{"markdownRemark":{"frontmatter":{"title":"Skills and interests","subtitle":"Who am I?"}},"allMarkdownRemark":{"edges":[{"node":{"id":"dc4232be-d818-5559-ba0d-5fcc1def6353","frontmatter":{"title":"Web Design","icon":"laptop-code","description":"Recently, I've been spending a lot of time learning about frontend development technologies. Has my effort paid off? See for yourself! Though right now this website is little more than a Gatsby template built on React and Tailwind, I'm constantly working to make it my own."}}},{"node":{"id":"1f2eeb47-3a4e-5bb5-b659-3a4e23546ddb","frontmatter":{"title":"Graphic Design","icon":"edit","description":"Also one of my most recent interests. This year I took it upon myself to learn digital drawing through tools like GIMP and PhotoShop, though I'd much rather support the open-source project. No gallery with my drawings as of yet, but one of my next projects for sure."}}},{"node":{"id":"e8ce5478-973e-574d-9598-539da35d990f","frontmatter":{"title":"Data Science and Engineering","icon":"bullhorn","description":"Most of my background in data science I have my major in college to thank for. Though statistics in software like Python and R is one of the biggest components in my data tool belt, I've also spent considerable time learning tools like MSSQL and MongoDB for business intelligence."}}},{"node":{"id":"e110c27e-11cd-5d7f-9361-f7f59fa28d45","frontmatter":{"title":"Mathematical Models and Optimization","icon":"draw-polygon","description":"I take great interest in computational mathematics, particularly so, in operations research. I've built most of my dev stack around the software that enables mathematical modeling such as mixed-integer programming or stochastic dynamic programming in Python, or statistics in R."}}},{"node":{"id":"ca552d7d-027a-55e2-bf75-29b297df73b1","frontmatter":{"title":"Language and Music","icon":"map-marker-alt","description":"I may be shy at times, but languages is what I do. I'm a native Spanish speaker, my English is fluent (beyond C1), my german is certified C1, and I'm getting my french back in check (last I looked I was near B1). Also, I've been playing the piano for a few years. It's a very gratifying hobby."}}},{"node":{"id":"382b6475-b332-50af-9c0a-67ff9c782bd1","frontmatter":{"title":"Physical Activity","icon":"biking","description":"I've been an athlete for as long as I can remember. I started doing gymnastics when I was two years old and have tried plenty other sports. The sports that matter to me the most are gymnastics and kitesurfing, the latter, mostly due to the adrenaline and because teaching it was my first job."}}}]}}}